---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ITransientElementMaker Members
ITransientElementMaker Interface Methods See Also Send Feedback
---

The ITransientElementMaker type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Implement this method to create transient elements. |

# See Also

ITransientElementMaker Interface

Autodesk.Revit.DB Namespace